import { FC } from 'react';
import styles from '/src/styles/Rule.module.css';
import { Link } from 'react-router-dom';
import arrow from '/src/assets/arrow-back.svg'
const Rule: FC = () => {
  return (
    <div className={styles.container}>
      <Link to={"/signUp"}>
        <img src={arrow} alt="" className={styles.arrow} />
      </Link>
      
      <h2 className={styles.title}><b>Правила использования сайта "Polytech доска объявлений"</b></h2>

      <section className={styles.section}>
        <h3>1. Регистрация и личные данные:</h3>
        <ul>
          <li>
            При регистрации пользователь обязан предоставить правдивую и актуальную информацию о себе, включая имя, адрес электронной почты и другие необходимые данные.
          </li>
          <li>
            Запрещено использование ложных имен, вымышленных персональных данных или данных других лиц.
          </li>
          <li>
            Пользователь обязан поддерживать актуальность своих личных данных и в случае изменения обязан незамедлительно обновить информацию в своем профиле.
          </li>
        </ul>
      </section>

      <section className={styles.section}>
        <h3>2. Объявления и контент:</h3>
        <ul>
          <li>
            Размещение объявлений, вакансий и другого контента на сайте должно соответствовать тематике колледжа и быть правдивым.
          </li>
          <li>
            Запрещено публиковать контент, нарушающий законы, моральные нормы или правила пользования сайтом.
          </li>
          <li>
            Администрация сайта оставляет за собой право удалить или заблокировать любое объявление или аккаунт пользователя без предварительного уведомления, если контент не соответствует правилам или является оскорбительным.
          </li>
        </ul>
      </section>

      <section className={styles.section}>
        <h3>3. Использование личных данных:</h3>
        <ul>
          <li>
            Пользователи не имеют право собирать, хранить или использовать личные данные других пользователей без их согласия.
          </li>
          <li>
            Запрещено распространение чужих личных данных на сайте.
          </li>
        </ul>
      </section>

      <section className={styles.section}>
        <h3>4. Соблюдение законов:</h3>
        <ul>
          <li>
            Пользователям запрещено размещать материалы, нарушающие законы страны, в которой они находятся или с которой взаимодействуют через сайт.
          </li>
          <li>
            Администрация сотрудничает с правоохранительными органами при обнаружении деятельности, нарушающей законы.
          </li>
        </ul>
      </section>

      <section className={styles.section}>
        <h3>5. Безопасность и конфиденциальность:</h3>
        <ul>
          <li>
            Пользователи обязаны бережно относиться к своим учетным данным и не передавать их третьим лицам.
          </li>
          <li>
            Запрещено использование учетных данных других пользователей.
          </li>
          <li>
            Администрация сайта предпримет все необходимые меры для обеспечения безопасности и конфиденциальности пользовательских данных.
          </li>
        </ul>
      </section>

      <section className={styles.section}>
        <h3>6. Соблюдение этических норм:</h3>
        <ul>
          <li>
            Пользователям следует вести себя этично и уважительно в общении с другими участниками сообщества.
          </li>
          <li>
            Запрещены оскорбительные высказывания, угрозы, дискриминация и другие формы неприемлемого поведения.
          </li>
        </ul>
      </section>

      <section className={styles.section}>
        <h3>7. Ответственность:</h3>
        <ul>
          <li>
            Пользователи несут ответственность за свои действия на сайте.
          </li>
          <li>
            Администрация сайта оставляет за собой право вносить изменения в правила без предварительного уведомления.
          </li>
        </ul>
        <p className={styles.warning}>
          Нарушение правил может привести к блокировке аккаунта или удалению контента.
        </p>
      </section>
    </div>
  );
};

export default Rule;
